#вынес белый список в отдельный класс, т.к. больно он громоздкий. неудобно стало

class fail2ban::whitelist {
	ini_setting {'fail2ban_ignoreips':
		#добавляем локальные сети в белый список
		$wl='127.0.0.0/8 10.0.0.0/8 172.16.0.0/12 192.168.0.0/16'
		
		#общие узлы ------
		$wl="$wl 94.181.46.36"		#Ревякин Домашний
		$wl="$wl 78.29.0.225"		#IS74 SIP trunk
		$wl="$wl 213.170.92.166"	#sip.telphin.com
		$wl="$wl 80.75.132.66"		#voip.mtt.ru
		$wl="$wl 95.167.163.148 212.48.197.150"		#Rostelekom VPBX
		$wl="$wl 188.234.136.49"	#ДомРу ВАТС
		$wl="$wl 87.249.220.242"	#Z-Телеком SIP Транк

		#узлы ЯДС
		$wl="$wl 176.96.80.135"		#Курганский офис
		$wl="$wl 94.24.244.234"		#Челябинский офис
		$wl="$wl 90.154.125.137"	#Москва - РТ
		$wl="$wl 178.57.93.227"		#Москва - Бизтелеком
		$wl="$wl 212.55.98.9"		#Усинск - РТ
		$wl="$wl 95.188.145.222"	#Красноярск - РТ
		$wl="$wl 83.69.6.192/28"	#196,197,198,199,200 - IS Leonenko Vasiliy (Salmuito)
		$wl="$wl 178.218.1.149"		#Сатис - 16023 Лабангашор
		$wl="$wl 178.218.2.215"		#Сатис - 16196 Куюмбинское
		$wl="$wl 91.109.231.128"	#Телепорт 064096 Таймыр
		$wl="$wl 91.109.227.129"	#Телепорт 212164 Шельф
		$wl="$wl 91.109.230.40"		#Телепорт 120800 Требса-ОБП
		$wl="$wl 31.10.12.105"		#Альтегро - Наульское м.р. (A83ZY652)
		$wl="$wl 31.10.12.126"		#Альтегро - Требса м.р. (A83NN231)
		$wl="$wl 31.10.12.99"		#Альтегро - Седтывис м.р. (A89YZ174)
		$wl="$wl 217.21.107.12"		#altegrosky NAT
 
		#Узлы Азимут
		$wl="$wl 87.249.213.70"		#azimut-chel-izet
		$wl="$wl 62.165.38.74"		#azimut-chel-ttk
		$wl="$wl 95.78.163.127"		#azimut-chel-ER-Telekom
		$wl="$wl 78.108.201.218"	#azimut msk
		$wl="$wl 95.167.177.66"		#azimut mhk

		# Узлы НПП ИКС
		$wl="$wl 83.142.162.38"		#осн. аплинк Интерсвязь
		$wl="$wl 95.78.181.53"		#рез. аплинк Домру
		$wl="$wl 94.181.47.214"		#Микросхема
		$wl="$wl 78.29.8.50"		#СпецТранс
		$wl="$wl 78.29.9.32"		#Норд (ЖЕК)
		$wl="$wl 78.29.13.69"		#Союз
		$wl="$wl 78.29.44.61"		#ЖСС+
		$wl="$wl 87.249.197.5"		#ЖРЭУ3

		path => '/etc/fail2ban/jail.conf',
		ensure => present,
		section => 'DEFAULT',
		setting => 'ignoreip',
		value =>   $wl,
		notify => Service['fail2ban']
	}
}
